#######################################################################################
#
# <スクリプト名>
# Ubuntu(Debian) - 自動アップデートスクリプト
#
# <概要>
# アップデート処理を行う
#
# <更新履歴>
# 20210920 - 新規作成
#
#######################################################################################
#!/bin/bash

#####################################################################
## 事前設定
#####################################################################

# 今日の日付を取得
today=$(date "+%Y%m%d")


######################################################################
## パラメータ設定
######################################################################

# ログディレクトリ
log_DIR="/var/log/update_log"

# ログファイル
log_FILE="/var/log/update_log/update_${today}.log"


######################################################################
## 必要リソースの生成
######################################################################

# ログディレクトリの生成
if [ ! -d $log_DIR ]; then
    sudo mkdir ${log_DIR}
fi

# ログファイルの生成
if [ ! -e $log_FILE ]; then
    sudo touch ${log_FILE}
fi


######################################################################
## 関数：アップデート処理
######################################################################

# アップデート処理
all_update () {
    sudo apt-get update -y
    sudo apt-get upgrade -y
    sudo apt-get autoremove -y
    sudo apt-get clean -y
    sudo apt-get autoclean -y
    sudo apt-get check -y
}


######################################################################
## 実行前処理
######################################################################

# ログ出力日時のフォーマットを yyyy/mm/dd hh:mm:ss に設定する
start_time=$(date '+%Y/%m/%d %T')

# 実行ログ見出し（開始）の出力
echo "##### $start_time start update #####" | sudo tee -a ${log_FILE}


######################################################################
## アップデート処理 
######################################################################

# アップデート処理
all_update | sudo tee -a ${log_FILE}


######################################################################
## 実行後処理
######################################################################

# ログ出力日時のフォーマットを yyyy/mm/dd hh:mm:ss に設定する
end_time=$(date '+%Y/%m/%d %T')

# 実行ログ見出し（終了）の出力
echo "###### $end_time end update ######" | sudo tee -a ${log_FILE}

# 再起動
sudo reboot
